<!--//安装锁定-->
<?php if(check_install()){ ?>
<div class="main" style="margin-top: -123px;">
	<b>
	 安装锁定，已经安装过了，如果您确定要重新安装，请到服务器上删除<br>
	 <?=$lockfile;?>
	</b>
	<ul style="line-height: 200%; margin-left: 30px;"></ul><br>
	<span class="red">您必须解决以上问题，安装才可以继续</span><br><br><br>
</div>
<?php }else{ ?>
<!--//安装协议-->
<div class="main" style="margin-top:-123px;">
	<div class="licenseblock">
	<div class="license">
		<h1>授权协议</h1>

	<p>版权所有 (c) 2001-2013，成都网悦科技有限责任公司保留所有权利。</p>
	
	<p>感谢您选择成都网悦科技产品。希望我们的努力能为您提供一个高效快速、强大的站点解决方案，和强大的淘客程序。轩宇淘客网址为 http://www.wangyue.cc，产品官方讨论区网址为 http://bbs.wangyue.cc。</p>
	
	<p>用户须知：本协议是您与成都网悦科技公司之间关于您使用成都网悦科技提供的软件产品及服务的法律协议。无论您是个人或组织、盈利与否、用途如何（包括以学习和研究为目的），均需仔细阅读本协议，包括免除或者限制成都网悦科技责任的免责条款及对您的权利限制。请您审阅并接受或不接受本服务条款。如您不同意本服务条款及/或成都网悦科技随时对其的修改，您应不使用或主动取消成都网悦科技公司提供的程序产品。否则，您的任何对成都网悦科技产品中的相关服务的注册、登陆、下载、查看等使用行为将被视为您对本服务条款全部的完全接受，包括接受成都网悦科技对服务条款随时所做的任何修改。
	</p>
	<p>本服务条款一旦发生变更, 成都网悦科技将在网页上公布修改内容。修改后的服务条款一旦在网站管理后台上公布即有效代替原来的服务条款。您可随时登陆成都网悦科技轩宇淘宝客官方论坛查阅最新版服务条款。如果您选择接受本条款，即表示您同意接受协议各项条件的约束。如果您不同意本服务条款，则不能获得使用本服务的权利。您若有违反本条款规定，成都网悦科技有权随时中止或终止您对成都网悦科技产品的使用资格并保留追究相关法律责任的权利。</p>
	<p>在理解、同意、并遵守本协议的全部条款后，方可开始使用轩宇淘宝客产品。您可能与成都网悦科技公司直接签订另一书面协议，以补充或者取代本协议的全部或者任何部分。</p>	<p></p>
	<p>成都网悦科技拥有本软件的全部知识产权。成都网悦科技只允许您在遵守本协议各项条款的情况下复制、下载、安装、使用或者以其他方式受益于本软件的功能或者知识产权。</p>
	
	<h3>I. 协议许可的权利</h3>
	<ol>
	&nbsp;  <li>您可以在完全遵守本许可协议的基础上，支付软件版权许可费，将本软件应用于商业用途。</li>
	&nbsp;  <li>您可以在协议规定的约束和限制范围内，支付软件版权许可费修改产品源代码或界面风格以适应您的网站要求。</li>
	&nbsp;  <li>您拥有使用本软件构建的网站中全部会员资料、文章及相关信息的所有权，并独立承担与使用本软件构建的网站内容的审核、注意义务，确保其不侵犯任何人的合法权益，独立承担因使用软件和服务带来的全部责任，若造成成都网悦公司或用户损失的，您应予以全部赔偿。</li>
	&nbsp;  <li>若您需将软件或服务用户商业用途，必须另行获得成都网悦的书面许可，您在获得商业授权之后，您可以将本软件应用于商业用途，同时依据所购买的授权类型中确定的技术支持期限、技术支持方式和技术支持内容，自购买时刻起，在技术支持期限内拥有通过指定的方式获得指定范围内的技术支持服务。商业授权用户享有反映和提出意见的权力，相关意见将被作为首要考虑，但没有一定被采纳的承诺或保证。</li>
	&nbsp;  <li>您可以从成都网悦官网中下载适合您网站的应用程序，但需支付相应的费用。</li>
	</ol>
	
	<h3>II. 协议规定的约束和限制</h3>
	<ol>
	&nbsp;  <li>未获成都网悦公司书面商业授权之前，不得将本软件用于商业用途。购买商业授权请登陆http://www.wangyue.cc参考相关说明</li>
	&nbsp;  <li>不得对本软件或与之关联的商业授权进行出租、出售、抵押或发放子许可证。</li>
	&nbsp;  <li>无论如何，即无论用途如何、是否经过修改或美化、修改程度如何，只要使用成都网悦产品的整体或任何部分，未经书面许可，页面页脚处的成都网悦产品名称和成都网悦公司下属网站（http://www.wangyue.cc、或 http://www.jiukuaiwu.com） 的链接都必须保留，而不能清除或修改。</li>
	&nbsp;  <li>禁止在成都网悦产品的整体或任何部分基础上以发展任何派生版本、修改版本或第三方版本用于重新分发。</li>
	&nbsp;  <li>您从官方网站下载的应用程序，未经书面许可，不得对其进行反向工程、反向汇编、反向编译等，不得擅自复制、修改、链接、转载、汇编、发表、出版、发展与之有关的衍生产品、作品等。</li>
	&nbsp;  <li>如果您未能遵守本协议的条款，您的授权将被终止，所许可的权利将被收回，同时您应承担相应法律责任。</li>
	</ol>
	
	<h3>III. 有限担保和免责声明</h3>
	<ol>
	&nbsp;  <li>本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。</li>
	&nbsp;  <li>用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未购买产品技术服务之前，我们不承诺提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任。</li>
	&nbsp;  <li>成都网悦不对使用本软件构建的网站的信息承担责任，全部责任由您自行承担。</li>
	&nbsp;  <li>成都网悦提供软件和服务之及时性、安全性、准确性不作担保，由于不可抗力因素、公司无法控制的因素（包括黑客攻击、停断电等）等造成软件使用和服务中止或终止，而给您造成损失的，您同意放弃追究成都网悦公司责任的全部权利。</li>
	</ol>
	
	<p>本许可协议条款的解释，效力及纠纷的解决，适用于中华人民共和国大陆法律。</p>
	
	<p>若您和成都网悦之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，您可放弃使用公司产品</p>
	
	<p>（正文完）</p>
	
	<p align="right">成都网悦时代科技有限公司</p>
	
	</div></div>
		<div class="btnbox marginbot">
			<form method="get" autocomplete="off" action="index.php">
			<input type="hidden" name="op" value="step1">
			<input type="submit" name="submit" value="我同意" style="padding: 2px">&nbsp;
			<input type="button" name="exit" value="我不同意" style="padding: 2px" onclick="javascript: window.close(); return false;">
			</form>
		</div>
</div>
<?php } ?>